app/Http/Controllers/Administrator_loginController.php

    public function login(Request $request)
    {
        // ログインIDとパスワードが一致するユーザーを検索する
        $credentials = $request->only('login_id', 'password');

        $user = AdminUser::where('login_id', $credentials['login_id'])->first();
---
select * from `admin_users` where `login_id` = '1111' limit 1