app/Http/Controllers/Employee_loginController.php

select * from `employees`
---
    public function showLoginForm()
    {
        $employees = Employee::all(); // 例としてすべての従業員データを取得