app/Http/Controllers/SituationController.php

select * from `attendances` where `attendances`.`employee_id` in (1, 2, 3)
select * from `employees`
---
    public function index()
    {
        $employees = Employee::with('attendances')->get();